БИТУправление_медицинским_центром_демо/src/Catalogs/ПрофилиПользователей/ПрофилиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиПользователей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.НастройкиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПрофилиПользователей/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Код,
		|	Пользователи.Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Профиль = &Профиль";	
	Запрос.УстановитьПараметр("Профиль", ЭтотОбъект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Обработаем Роли ПользователяИБ
		КлиентИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ВыборкаДетальныеЗаписи.Код));
		Если КлиентИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КлиентИБ.Роли.Очистить();
		Для каждого Строка из ЭтотОбъект.Роли Цикл			
			РольПоСтроке = Метаданные.Роли.Найти(Строка.Роль);
			Если РольПоСтроке <> Неопределено Тогда
				КлиентИБ.Роли.Добавить(РольПоСтроке);
			КонецЕсли;
		КонецЦикла;
		КлиентИБ.Записать();
		// Обработаем настройки пользователя.
		Набор = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		Набор.Прочитать();
		ТабНабор = Набор.Выгрузить();
		Для Каждого СтрокаНастройки Из ЭтотОбъект.Настройки.НайтиСтроки(Новый Структура("Используется", Истина)) Цикл
			
			Запись = ТабНабор.Найти(СтрокаНастройки.Настройка, "Настройка");
			Если Запись = Неопределено Тогда
				Запись				= ТабНабор.Добавить();
				Запись.Пользователь	= ВыборкаДетальныеЗаписи.Ссылка;
				Запись.Настройка	= СтрокаНастройки.Настройка;
			КонецЕсли;
			Запись.Значение = СтрокаНастройки.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастройки.Значение);
			
		КонецЦикла;
		Набор.Загрузить(ТабНабор);
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
